{"Amegakure": "In Shikamaru Hiden, set several years after the Fourth Shinobi World War, Ame is invited to join the Shinobi Union. Despite this, the village was slow to rebuild following the defeat of Akatsuki in the War as well as the deaths of Konan and Nagato. Even the damage from Jiraiya's battle with the Six Paths of Pain hadn't been repaired in the decades following the War, and the cityscape was mostly abandoned by the time of Naruto's reign as Hokage. As such, it was used by Kara, which maintained a secret research facility in it for a while before abandoning it. When Sasuke and Sai investigated the village, looking for information about Kara, they triggered a trap left behind which destroyed the facility. After the Seventh Hokage learned of the village's terrible state, he decided to begin efforts for restoring the village.[6]\n", "Kirigakure": "Years after the Fourth Shinobi World War, during the Sixth Mizukage's era and with the aid of the Fifth, Kiri had become a modern and thriving city; even more progressed than Konohagakure. They also managed to retrieve the six blades that were lost to defections, thus reinstating the Seven Ninja Swordsmen of the Mist. In addition, the positive outlook to the village made it a well-known tourist destination.[14] While the large majority of citizens are happy with the brimming liveliness of their new transformed and cheerful village,[15] there was still a small minority that was both very distrusting and hateful towards outsiders. Viewing this friendly, peaceful infrastructure as an insult to their pride as ninja, this minority openly longed for the old days of the \"Blood Mist Village\". Despite the village's progress to move to a brighter future, the Fourth Mizukage's dark legacy was never forgiven, as many villagers continued to despise him to the point of mistreating his descendants. When the Funato clan rose up against the Land of Water for its modernisation, they nearly went to war with Kirigakure. However, with the assistance of Boruto Uzumaki, they managed to quell the war before it began, and Kiri came to realise that they have progressed too rapidly without approval from the populace, and agreed to slow down.\n", "Hoshigakure": "The underground hideout of Natsuhi and Hotarubi was situated outside the village, within the nearby forests. After Hotarubi's death, Natsuhi lived there alone for years.\n", "Hachō_Village": "The Hachō Village (ハチョウ村, Hachō-mura) is a village lying on the outskirts of the border of the Land of Fire. They are on very friendly terms with the Tonika Village. When the village was attacked by Kabuto Yakushi in his attempt to gain access to The Hole, the villagers that were able to survive all fled to this village and the Hachō Village later sent officers to help guard the ruined village. Disonasu, the village head also went to the Tonika Village to aid in the village's rehabilitation.[1]\n", "Bamboo_Village": "The Bamboo Village (竹ノ村, Take no Mura) is a small village in the Land of Hot Water. It is surrounded by a forest of bamboo, and as such most of the village's buildings and goods are made out of bamboo. Because it is such a remote village, the villagers received aid from the Lightning Group in the past. When the Lightning Group came into conflict with Kirigakure, its surviving members sought refuge in Bamboo Village. The villagers refused to help them, fearing reprisal from Kiri. Years later, this rejection of the Lightning Group causes Bamboo Village to be attacked by the Dark Thunder Group, but the village is saved by Sasuke Uchiha.\n", "Konohagakure": "Konoha has a protocol in case the village is ever under attack.[23]\n", "Tsuchigumo_Village": "They later appeared as a mind-controlled horde, used by the Magaki group against Sakura, Sai, Yamato, Naruto and Utakata. After the Magaki group's defeat, the Tsuchigumo village was freed from their control and the chief stated that he and the villagers would accept Hotaru with the kinjutsu gone.\n", "Curtain_Village": "Curtain Village (幄の里, Tobari no Sato) is the capital of the Land of Silence.[1] The city hosts the only black market in the region.[2] The majority of its citizens live in poverty and crime; many former shinobi sell their headbands in exchange for money, while a select few nobility are afforded everything they want. The village is also swarmed with criminals and figures from Konohagakure's Bingo Book.[3] In the middle of the village is Fushū Castle.\n", "Tonika_Village": "The Tonika Village (トニカ村, Tonika-mura) is a village located on the outskirts of the border of the Land of Fire. It is also where The Hole is located. The village was destroyed during Kabuto Yakushi's invasion which was geared towards acquiring The Hole to conduct his experiments. During the invasion, the villagers fought bravely to defend their home, but Kabuto's reincarnated pawns were too powerful and overwhelming. During this time, Dokku instructed Miina and Leo to flee to the Hachō Village, which is a friendly neighbouring town.\n", "Kusagakure": "Main article: Hōzuki Castle\nThe Hōzuki Castle (鬼灯城, Hōzuki-jō, literally meaning: Demon Lantern Castle), also known as the Blood Prison (ブラッド・プリズン, Buraddo Purizun), is a large castle that is controlled by Kusagakure and serves as a criminal containment facility.\n", "Mount_Katsuragi": "Mount Katsuragi became the home of the loyalists to En no Gyōja after he and the elders of the clan split over the fate of the Tsuchigumo clan's kinjutsu. The majority of the clan remained in the village with the elders, while the few loyalists left for Mount Katsuragi, where their numbers dwindled down over the years to Hotaru and Tonbee.\n", "Iwagakure": "Years after the Fourth Shinobi World War, the Third Tsuchikage was left disillusioned with their newfound peace when a missing-nin attacked the village that left many genin dead due to their waning strength from inactivity. As a result, he went to research on creating Akuta, artificial soldiers who would supplant the shinobi to protect the weak. However, due to the sudden disobedience of these creatures during the demonstration, along with such attempts to build a private army being in transgression of the agreements of the Union, the Fourth Tsuchikage banned any further developments. Nevertheless, the Third would continue his work in secret, creating Fabrications to serve as commanders for his Akuta army. However, Ōnoki's plans went awry when the Fabrications gained their own free will from their desire to live longer than their fragile artificial lives would allow, which led to their revolt against the village by placing it under lock-down while trying to sacrifice five villagers to transplant their human hearts into themselves. With the help of Konohagakure's Teams 7 and 10, the Fabrications were defeated and the Akuta army were destroyed, although Ōnoki died while fighting the last Fabrication. Although Iwagakure, the Five Kage and the small amount of Konohagakure teams knew of the truth, the rest of the world were given a cover story that Ōnoki died from ill-health during a dissenter attack on the village that was suppressed by Kurotsuchi.\n", "Kumogakure": "However, tensions did arise shortly after the attack of Momoshiki and Kinshiki Ōtsutsuki; Iwagakure was ordered by their Daimyō, Danjō, to invade and conquer the Land of Flowers, whom Kumogakure are obligated to protect due to their alliance. Kirigakure would also side with Iwa due to their trade in vital minerals, which would lead to a potential Fifth Shinobi World War that would dissolve the Shinobi Union and irretrievably destroy the peace that was so hard earned. Fortunately, due to the diplomatic assistance granted by the Seventh Hokage and Ikkyū Madoka, they were able to convince Danjō to call off the invasion, thus averting war.[4]\n", "Yukigakure": "At the end of the movie, the snow in the country is subsequently melted by a heating device. Koyuki Kazahana stated that, with further research into said device, the Land of Snow can one day become the Land of Spring (春の国, Haru no Kuni).\n", "Kagerō_Village": "Kagerō Village (陽炎の里, Kagerō no Sato, English TV: Heat Devil Village, literally meaning: Heat Haze Village), was a small village located in the Land of Mountains. Thirty years before the start of the series, it was at war with Konoha. Three months after a surprise attack by the Third Hokage, Jiraiya and several other Konoha ninja, they declared a cease-fire. Two weeks later, however, they were wiped out by shinobi from Tanigakure. Only Gennō, who had been in Konoha at the time planting explosive tags for a possible counter-attack, survived its destruction.\n", "Ishigakure": "Ishigakure (石隠れの里, Ishigakure no Sato, Viz: Hidden Rock Village, literally meaning: Village Hidden in Stones) is the hidden village of the country located between the Land of Earth and the Land of Wind. In Gaara Hiden, several terrorists with kekkei genkai hail from this village.\n", "Tanigakure": "Thirty years before the start of the series, this village ambushed Kagerō Village two weeks after they had agreed to a ceasefire with Konohagakure. Gennō is the sole survivor of that attack, as he was in Konoha at the time.[1]\n", "Jōmae_Village": "The Jōmae Village (錠前の里, Jōmae no Sato, literally meaning: Lock Village) is an anime-only shinobi village located in the Land of Keys. This village's shinobi are experts in espionage in order to gain information for negotiations with larger, more powerful nations. In this village, ninja seem to be specifically trained in gaining information while giving none in return as evident by Hanare's Eye Mind Reading technique and their leader's willingness to commit suicide rather than be taken hostage by enemy ninja.\n", "Kisaragi_Village": "Kisaragi Village (如月の里, Kisaragi no Sato) is a village south of Konohagakure. It was the subject of attacks by bandits in league with the Shirogane clan in their search for the spirit orbs.\n", "Ryūchi_Cave": "In the anime, journey to Ryūchi Cave takes only a couple days from Konohagakure. While many travellers may venture close to it unknowingly, the snakes of Ryūchi Cave take precautions so that only those who are deliberately trying to visit it can arrive at it. In their experience, only those willing to sacrifice anything in their greed for power come to Ryūchi Cave. In order to be granted audience to learn senjutsu with the White Snake Sage, one must pass three trials posed by the snakes. According to the rules, if a candidate fails at any of the trials, the snakes are allowed to devour them and consume their chakra.[3] At least one section of the cave is made of limestone, and despite nominally being a cave, its territories also include wetlands.[4]\n", "Tsukigakure": "\"In a time of war, a wanderer from afar did happen upon the Tsukigakure. Great were the trials he endured to drive off the destruction that placed the moon in such peril. He had a noble heart and a spirit bound by none. So was revealed our heroic saviour. His name rang with the pureness of his soul. Like unto a gentle breeze.\"\n", "Genjutsu_Tree_Village": "This unnamed village is hidden among special trees that produce a genjutsu-like effect, thus protecting the village from invaders. Naruto and Jiraiya came to the village to hone Naruto's genjutsu-repelling abilities. Villagers use Chilli Pepper Bombs to counter the genjutsu-like effects. There, they encountered Kandachi and his helpers. With the help of Tanishi, Naruto and Jiraiya managed to defeat their foe.\n", "Uzushiogakure": "Uzushiogakure had close ties with Konohagakure, due to Uzushio's Uzumaki clan and Konoha's Senju clan being distant blood relatives. Because of this, all flak jackets of Konohagakure bear the crest of Uzushiogakure, symbolising the strong friendship between both villages.[1] In the manga, Otogakure's official attire also includes a symbol of Uzushiogakure.[2]\n", "Daidai_Village": "Daidai Village (橙村, Daidai-mura) is a small village inhabited by the members of the Yoimura Clan.\n", "Yugakure": "Yugakure is surrounded by several different hotsprings, and so thick steam rises up around the village. Many resort hotels are built throughout the area for the hotsprings' visitors to stay in.\n", "Nadeshiko_Village": "The village itself is positioned upon the lightly forested top of three massive and steep hills standing in a line, with two bridges spanning the gorges between them. The hills are situated within a lush forested valley in a mountainous region. In terms of construction the village seems to be similar to a stronghold or palace, with numerous walls, towers and brickwork being dominant features.\n", "Inaho_Village": "Inaho Village (稲穂村, Inaho-mura, English TV: Rice Village) is located near the hills where Genmai was kidnapped.\n", "Sunagakure": "\nAfter the other villages experience their own attacks by Akatsuki, they decide to form the Allied Shinobi Forces to oppose Akatsuki in the Fourth Shinobi World War. Being so much younger than his fellow Kage, Gaara is able to persuade the other Kage of how outdated their methodologies are and also proves inspirational in convincing the diverse Allied Forces set aside their differences and work together. Suna's forces prove valuable during the war, particularly with the Cloth Binding Technique to neutralise the Impure World Reincarnation. Although the villagers were amongst the mass of the world to be trapped in the Infinite Tsukuyomi and God: Nativity of a World of Trees, the war is eventually won and the villages are all left on good terms.", "Yumegakure": "The Prison of the Three-Heads lies hidden within a large cave situated inside a volcano, not far from Yumegakure. The cave's layout primarily consists of a number of lava pools, with dark stalactites and stalagmites. The prison itself is a small blue orb situated at the back of the cave.\n", "Shimogakure": "Shimogakure (霜隠れの里, Shimogakure no Sato, literally meaning: Village Hidden in Frost) is the hidden village located in the Land of Frost.\n", "Ceramic_Village": "Ten years after Mashō's death, Sasori and Deidara of Akatsuki travelled to Ceramic Village to seek out the clay used in the Hanasaki style. In the course of doing so the village was destroyed by Deidara's C2. Only Kanyū, the last practitioner of Hanasaki, survived.\n", "Shangri-la": "Shangri-la was eventually found by the bounty-hunter Kakuzu and his partner, Hidan, with help from Shangri-la resident Ameyuki. Kakuzu and Hidan killed many of the villagers in order to collect the bounties, but it was Ameyuki who ultimately destroyed the village: he used Mud Release: Landslide to collapse the mountain upon the village, killing everyone as a sacrifice to Jashin.\n", "Takigakure": "In the anime, Shibuki, the head of the village, resides in a small wooden hut, that is built near some trees, which has a sign with a kanji for Taki (滝, Taki, literally meaning: Waterfall) above the entrance. The interior seems to be rather spartan, as it doesn't contain much space or some necessary furniture, like a table or chairs, with the village leader sitting on a raised dais on the floor.\n", "Takumi_Village": "Four skilled craftsmen trained harder than the others in the ninja arts, wore the Takumi symbol on their forehead protector, and sought to resurrect their village founder, Seimei. They planned to resurrect him using the One-Tailed Shukaku inside of Gaara and use him to seek revenge against the Five Great Shinobi Villages. They operated under the name Four Celestial Symbols Men, or the Four Heavenly Directions. This name stemmed from the characters in their name matching with the deities of the directions: Hōki the Turtle, Kujaku the Bird, Ryūgan the Dragon, and Suiko the Tiger.\n", "Howling_Wolf_Village": "The Howling Wolf Village declared itself neutral from all conflicts and ended all shinobi-related services; most weapons were also outlawed within the village. Though some of its former shinobi were able to find new jobs as police and guards, others left the village to find work elsewhere. Those who remained turned to saigenzai, a hallucinogen that helped them cope with their mundane lives. The rest of the village, however, enjoyed the newfound peace. The pathway leading to the village is marked with eighty-eight torii to symbolise the village's separation from how the rest of the world works.\n", "Mount_Myōboku": "The toad summoning contract", "Shikkotsu_Forest": "The Shikkotsu Forest (湿骨林, Shikkotsurin, English TV: Shikkotsu Woods, literally meaning: Damp Bone Forest) is a legendary place and one of the three unexplored sage regions; the other two being: Mount Myōboku and Ryūchi Cave.[1][2] It is the home of the slug Katsuyu,[3] parts of which are summoned by Tsunade and her disciple Sakura Haruno.\n", "Otogakure": "This anime-only laboratory is located in the Demon Island of the Land of the Sea. It is an experimental laboratory with many transgenic creatures contained in test pillars. Some time before the start of the series, Amachi, the lead scientist, and Orochimaru terrorised the people of the Land of the Sea by kidnapping the citizens for their deadly experiments, which included making the ultimate underwater ninja, an idea later abandoned by Orochimaru.\n", "Sugi_Village": "Kumogakure once stole a scroll containing secret ninjutsu belonging to this village. While nothing is known about what the technique concerns, it was apparently powerful enough for the Fourth Raikage himself to be involved in the mission to obtain it. The village immediately tried to retrieve the scroll by hiring the Nokizaru Group to go after the thieves.\n"}